## 실습 설명
수강 신청이 완료되었습니다. 이제 각 과목을 수강하는 학생수에 따라 크기가 다른 강의실을 배치하려고 합니다.

강의실은 규모에 따라 “Auditorium”, “Large room”, “Medium room”, “Small room” 총 4가지 종류가 있습니다.

아래 조건에 따라 강의실 종류를 지정해 주세요.

1. 80명 이상의 학생이 수강하는 과목은 “Auditorium”에서 진행됩니다.
2. 40명 이상, 80명 미만의 학생이 수강하는 과목은 “Large room”에서 진행됩니다.
3. 15명 이상, 40명 미만의 학생이 수강하는 과목은 “Medium room”에서 진행됩니다.
4. 5명 이상, 15명 미만의 학생이 수강하는 과목은 “Small room”에서 진행됩니다.
5. 폐강 등의 이유로 status가 “not allowed”인 수강생은 room assignment 또한 “not assigned”가 되어야 합니다.

## 해결방법

## 1.
### 람다로 해결하기
#### df.loc[df['columns'].apply(lambda x : 조건), 'col명'] = '값'

## 2.
### 리스트로 해결하기
#### 변수 = list(컬럼의 값 개수[(조건)].index)
#### for new in 변수:
####    df.loc[df['컬럼명'] == new, '추가할 컬럼명'] = '추가할 값'

In [79]:
import pandas as pd

df = pd.read_csv('../data/enrolment_2.csv')
df

           id  year             course name       status
0     2777729     1  information technology  not allowed
1     2777730     2                 science      allowed
2     2777765     1                    arts      allowed
3     2777766     2                    arts      allowed
4     2777785     1                     mba      allowed
...       ...   ...                     ...          ...
1995  2796805     3    computer application      allowed
1996  2796812     1                 nursing      allowed
1997  2796813     2                 nursing      allowed
1998  2796814     3                 nursing      allowed
1999  2796815     4                 nursing      allowed

[2000 rows x 4 columns]

In [80]:
course_counts = df['course name'].value_counts()

In [81]:
df

           id  year             course name       status
0     2777729     1  information technology  not allowed
1     2777730     2                 science      allowed
2     2777765     1                    arts      allowed
3     2777766     2                    arts      allowed
4     2777785     1                     mba      allowed
...       ...   ...                     ...          ...
1995  2796805     3    computer application      allowed
1996  2796812     1                 nursing      allowed
1997  2796813     2                 nursing      allowed
1998  2796814     3                 nursing      allowed
1999  2796815     4                 nursing      allowed

[2000 rows x 4 columns]

### 1. 80명 이상의 학생이 수강하는 과목은 “Auditorium”에서 진행됩니다.

In [82]:
course_counts = df['course name'].value_counts()

In [83]:
Auditorium = list(course_counts[course_counts >= 80].index)

for auditorium in Auditorium:
    df.loc[df['course name'] == auditorium, 'room assignment'] = 'Auditorium'

In [84]:
df

           id  year             course name       status room assignment
0     2777729     1  information technology  not allowed             nan
1     2777730     2                 science      allowed      Auditorium
2     2777765     1                    arts      allowed      Auditorium
3     2777766     2                    arts      allowed      Auditorium
4     2777785     1                     mba      allowed             nan
...       ...   ...                     ...          ...             ...
1995  2796805     3    computer application      allowed             nan
1996  2796812     1                 nursing      allowed             nan
1997  2796813     2                 nursing      allowed             nan
1998  2796814     3                 nursing      allowed             nan
1999  2796815     4                 nursing      allowed             nan

[2000 rows x 5 columns]

### 2. 40명 이상, 80명 미만의 학생이 수강하는 과목은 “Large room”에서 진행됩니다.

In [85]:
df.loc[df['course name'].apply(lambda x : 40 <= course_counts[x] < 80),'room assignment'] = 'Large room'

In [86]:
df

           id  year             course name       status room assignment
0     2777729     1  information technology  not allowed             nan
1     2777730     2                 science      allowed      Auditorium
2     2777765     1                    arts      allowed      Auditorium
3     2777766     2                    arts      allowed      Auditorium
4     2777785     1                     mba      allowed             nan
...       ...   ...                     ...          ...             ...
1995  2796805     3    computer application      allowed             nan
1996  2796812     1                 nursing      allowed             nan
1997  2796813     2                 nursing      allowed             nan
1998  2796814     3                 nursing      allowed             nan
1999  2796815     4                 nursing      allowed             nan

[2000 rows x 5 columns]

### 3. 15명 이상, 40명 미만의 학생이 수강하는 과목은 “Medium room”에서 진행됩니다.

In [93]:
Medium_room = list(course_counts[(course_counts >= 15) & (course_counts <40)].index)

for medium_room in Medium_room:
    df.loc[df['course name'] == medium_room, 'room assignment'] = 'Medium room'

In [94]:
df

           id  year             course name       status room assignment
0     2777729     1  information technology  not allowed     Medium room
1     2777730     2                 science      allowed      Auditorium
2     2777765     1                    arts      allowed      Auditorium
3     2777766     2                    arts      allowed      Auditorium
4     2777785     1                     mba      allowed      Small room
...       ...   ...                     ...          ...             ...
1995  2796805     3    computer application      allowed     Medium room
1996  2796812     1                 nursing      allowed     Medium room
1997  2796813     2                 nursing      allowed     Medium room
1998  2796814     3                 nursing      allowed     Medium room
1999  2796815     4                 nursing      allowed     Medium room

[2000 rows x 5 columns]

### 5명 이상, 15명 미만의 학생이 수강하는 과목은 “Small room”에서 진행됩니다.

In [89]:
df.loc[df['course name'].apply(lambda x : 5 <= course_counts[x] < 15),'room assignment'] = 'Small room'

In [90]:
df

           id  year             course name       status room assignment
0     2777729     1  information technology  not allowed     Medium room
1     2777730     2                 science      allowed      Auditorium
2     2777765     1                    arts      allowed      Auditorium
3     2777766     2                    arts      allowed      Auditorium
4     2777785     1                     mba      allowed      Small room
...       ...   ...                     ...          ...             ...
1995  2796805     3    computer application      allowed     Medium room
1996  2796812     1                 nursing      allowed     Medium room
1997  2796813     2                 nursing      allowed     Medium room
1998  2796814     3                 nursing      allowed     Medium room
1999  2796815     4                 nursing      allowed     Medium room

[2000 rows x 5 columns]

### 폐강 등의 이유로 status가 “not allowed”인 수강생은 room assignment 또한 “not assigned”가 되어야 합니다.

In [91]:
not_assigned = df['status'] == 'not allowed'
df.loc[not_assigned,'room assignment'] = 'not assigned'

In [92]:
df

           id  year             course name       status room assignment
0     2777729     1  information technology  not allowed    not assigned
1     2777730     2                 science      allowed      Auditorium
2     2777765     1                    arts      allowed      Auditorium
3     2777766     2                    arts      allowed      Auditorium
4     2777785     1                     mba      allowed      Small room
...       ...   ...                     ...          ...             ...
1995  2796805     3    computer application      allowed     Medium room
1996  2796812     1                 nursing      allowed     Medium room
1997  2796813     2                 nursing      allowed     Medium room
1998  2796814     3                 nursing      allowed     Medium room
1999  2796815     4                 nursing      allowed     Medium room

[2000 rows x 5 columns]